In [1]:
#Obtener la diferencia entre el salario más alto y el más bajo

In [2]:
import pandas as pd
import numpy as np

In [3]:
dict_1={
    "Nombre":["Ringo","John","Paul","George","Yoko"],
    "Edad":[45,34,42,38,47],
    "Salario":[12000,14000,13000,11000,10000],
    "Genero":["M","M","M","M","F"]
}

In [4]:
data=pd.DataFrame(dict_1)

In [5]:
data.head()

   Nombre  Edad  Salario Genero
0   Ringo    45    12000      M
1    John    34    14000      M
2    Paul    42    13000      M
3  George    38    11000      M
4    Yoko    47    10000      F

In [6]:
salmin=data[data["Salario"]==data["Salario"].min()]
salmin

  Nombre  Edad  Salario Genero
4   Yoko    47    10000      F

In [7]:
data[data["Salario"]==data["Salario"].max()]

  Nombre  Edad  Salario Genero
1   John    34    14000      M

In [8]:
data.iat[1,2]

14000

In [9]:
data.iat[1,2]-data.iat[4,2]

4000